[
  {
    "name": "Jiahao Dong",
    "strength": "ability to listen and learn.",
    "industries": "Big Tech (Apple, Tesla, NVidia, Google, Meta, etc.), Startups",
    "resume": "JIAHAO DONG 732-640-7435 | joedms616@gmail.com linkedin | github  EDUCATION Cornell Tech at Cornell University – New York, NY (GPA: 3.85) M.S. Information Science and Systems Relevant Coursework: Algorithms and Data Structures, Startup Systems, Data Science in the Wild, Applied Machine Learning, Computer Vision, Deep Learning, Deep Generative Models, Web Security, Digital privacy  Aug 2021 - May 2023  Rutgers University – New Brunswick, NJ B.A. Computer Science and B.A. Mathematics (GPA: 3.85; CS major: 4.0) Relevant Coursework: Computer Architecture, AI Engineering, Data Science, Graph Theory, Numerical Analysis, Logics  Sep 2018 - May 2021  EXPERIENCE Kanopy Labs, Software Engineer Intern – New York, NY ● Spearheaded development of  a backend layer using Prisma ORM/Postgres to allow admins and players to manage and enter NFT  May 2022 – Sep 2022  raffles on the HYHU raffle site at scale.  ● Designed, coded, and reviewed TypeScript/Next.js code for frontend, backend, and infrastructure components. ● Deployed ERC721A smart contracts and minting pages in TypeScript/Solidity for Healthies and Metaluxe.com. ● Set up CI/CD and E2E testing tools for projects using Github Action/Vercel/Cypress, ensuring code quality and accuracy.  Cornell AAP Design Across Scales Lab, Research Assistant – New York, NY ● Brainstormed ways to quantify the impact of  vegetation on human comfort levels in NYC by analyzing tree census data and NYC  May 2022 – present  Lidar scan datasets as part of  a research team.  ● Researched approaches for large point cloud/CityGML data visualization on the web. ● Built Cesium.js/MapBoxGL web viewers illustrating shadows cast by trees along NYC streets on vertical surfaces and point cloud  classification of  trees/buildings/ground surfaces.  ● The project is documented here.  WANJIA Asset Co, Summer Analyst – Shanghai, China May 2019 – Jul 2019 ● Initiated data cleaning/exploratory analysis for data collected from the Wind terminal and company-owned data to aid equity research. ● Examined and verified monthly/quarterly reports for funds.  COMPETITION ICPC Columbia Local: Rank  22 Brooklyn half  marathon: 2 hr  Sep2022 Apr2022  TECHNICAL SKILLS Languages: Data: Web: Geo: System:  Python, JavaScript, TypeScript, Java, SQL, Go, Elixir, Rust, Solidity Numpy, Pandas, ResearchPy, Matplotlib, Tableau, Pyspark, PyTorch Next.js, React.js, Node.js, Express, Flask, FastAPI, Three.js, GithubAction, RESTful, tRPC Cesium.js, MapBoxGL, Deck.gl MongoDB, Firebase, Postgres, Prisma ORM, Docker, Git, AWS  PROJECT Internet of  Things-enabled interpersonal violence case study ● Researched and designed tools which will allow IPV experts to scan and identify suspicious IoT devices based on research identifying  Jan 2022 – Jan 2023  characteristics of  IoT devices being used to assist in interpersonal violence.  ● Developed a demo website which walks users through the process of  collecting local network traffic data. ● Helped design an analytical workflow for interpreting Wireshark data on internet traffic.  Social Media data analysis on investment decisions ● Analyzed Elon Musk’s tweets, collected using Twitter API, and retrieved a correlation matrix for each feature and target in the data. ● Implemented and tuned machine learning models predicting TSLA stock fluctuations, achieving over 64% accuracy.  Sep 2021 – Dec 2021  \f"
  },
  {
    "name": "Pedro Ortego",
    "strength": "Problem solving and Fast Learning",
    "industries": "No Preference!",
    "resume": "PEDRO ORTEGO  New York, NY | 646-853-7452 | po93@cornell.edu  LinkedIn | Portfolio | GitHub   EDUCATION  Cornell Tech, New York, NY  Master of Engineering in Computer Science | GPA: 4.0  Merit-Based Scholarship  Relevant Coursework: Machine Learning Engineering, Applied Machine Learning, VR and AR, HCI & Design.                                             Aug 2022 - Present   University of Navarra - TECNUN, Donostia, Spain    Bachelor of Science in Computer Science | Major GPA: 3.9 Rank: 1st in class  Three Merit-Based Scholarships (Full Right Tuition)  Relevant Coursework: Computer Programming, Computer Architecture, Machine Learning Algorithms, Python Programming,  Information Theory, Digital Signal Processing.             Aug 2018 – Jun 2022   TECHNICAL SKILLS  Coding Language:  Other Tools:      Python, C++, C#, MATLAB, HTML, Java, JavaScript, SQL, NoSQL, CSS   TensorFlow, PyTorch, Excel, Pandas, NumPy, Unity, Git, GitHub, React, WebGL, AWS   EXPERIENCE   Machine Learning Engineer, LainoMedical, Spain                 Jun 2021 – Jul 2022   •  Created and implemented a machine learning algorithm for medical solution detection and identification.  •  Designed and implemented a TensorFlow-based RNN model in Python to detect, identify, and classify medical solutions in the   company's products using RFID technology.   •  Conducted experiments to evaluate the performance of the model, utilizing scikit-learn in Python and achieving over 99%   accuracy.   •  Developed chipless RFID tags for medicine capsules and integrated the complete system for practical use in the company's   products, resulting in a significant cost savings of over 70% of  by eliminating the need for RFID chips.   Machine Learning Research Assistant, Tecnun, Spain   •  Designed new healthcare applications using Machine Learning Algorithms.               Sep 2020 – Jan 2022   o  Conducted extensive research on the latest advancements in machine learning algorithms and applied these in the design   of new applications.   o  Worked closely with healthcare experts to identify their needs and requirements, and designed applications that met   those needs and requirements.   •  Researched new Machine Learning models for these applications (Python).   o  o   Increased the efficiency of these applications by 30% compared to traditional applications.  Improved the accuracy of the algorithms by 50%, leading to more accurate predictions and better outcomes.   •  Led a team of 5 students managing their workload and assigning deadlines. Hugely improved my teamwork skills as well as my   leadership skills.   CampusHome, Software Developer Intern, Spain               Jul 2019 – Sep 2019   Search for bugs in upcoming software releases, helping the development team troubleshoot any issues.    •  •  Collaborated with a 5-member team to release a new system suite, saving the company $12K in monthly QA costs.  •  Designed and implemented 50+ E2E tests using Selenium, simulating each user group’s actions.   PROJECTS   MiniTorch, (Python)              Spring 2023    •  Developed a lightweight implementation of a machine learning library in Python, similar to PyTorch, that allows for basic   machine learning tasks such as building, training, and evaluating neural networks.   AR application for surgery, (C#, Unity)   •  Collaborated with Weill Cornell in the development of an application for guidance and education in catheter based surgery   procedures.   Music Generation using AI, (Python)   Exploring AI methods to generate sequences of musical notes in a way that makes sense and sounds good.   Fall 2022    •  Developed a program using Neural Networks, specifically Long Short-Term Memory (LSTM), and Keras, a high-level neural   network for simplifying interactions with TensorFlow.                                                                                                                                                 \f"
  },
  {
    "name": "Hayden Daly",
    "strength": "Backend programming",
    "industries": "No Preference!",
    "resume": "HAYDEN DALY  hcdaly.dev | hcd36@cornell.edu | (818) 519-1330 github.com/haydendaly | linkedin.com/in/haydendaly  EDUCATION  EXPERIENCE  Cornell University Jacobs Technion-Cornell Institute Aug 2021 - May 2023 GPA: 4.00 M.S. Information Systems M.S. Applied Information Science  Stevens Institute of Technology Aug 2018 - May 2021 GPA: 3.94 B.Eng. Software Engineering  Relevant Coursework: Design Patterns for Derivative Pricing Advanced Algorithms Cryptography Machine Learning Engineering Pricing and Revenue Management  SKILLS  Languages: Python, Go, TypeScript, C++, Java, Ruby, SQL, Solidity  Systems: AWS/GCP, Docker, Kubernetes, Terraform, UNIX, Redis, Linux, Git  Libraries: NumPy, Pandas, Cython, PyTorch, Scikit, Matplotlib, Boost, Numba  Web: React (Native), Node.js, Koa, Flask, Express, GraphQL, Redux, HTML/CSS  ACTIVITIES  Hackathon Organizer: SVC Mentor: Launchpad@Stevens Varsity Athlete: Stevens XC/TF  Sutro, Software Engineer • Architected compiler for DSL representing full-stack applications at  Feb 2022 - Present  Sequoia-backed startup ($2.2m seed round).  • Crafted interpreter to recursively hydrate UI-tree with native elements,  local network contexts, and global reducer in React Native. • Designed distributed ETL/query language and actions system.  Stripe, Software Engineer Intern May 2022 - Aug 2022 • Developed Go API to manage locks on infrastructure automation of 1100  services supporting 300 QPS.  • Created incident remediation tool (go/stop) and presented on company-  wide call with CEO (1700 attendees), at request of CTO.  • Published Ruby CLI to control high-availability service fallback in S3.  Kanopy Labs, Software Manager • Recruited engineers, architected systems, and setup tooling for  Dec 2021 - Aug 2022  Whop.com, Posh.vip, Yayem.co, and other startups.  • Managed team of 5 developers and achieved $60k/month from clients. • Created DSL / compiler for gas-optimized EVM smart contracts.  Expo, Software Engineer Intern • Spearheaded internal tools: gathered requirements, built platform, and  May 2021 - Aug 2021  deployed on GKE cluster for 20 DAUs.  • Wrote system to generate GraphQL types / resolvers to replace 7k LOC. • Built fuzz-testing library to increase unit-test coverage by 14%.  Collective Design Lab, Research Assistant • Authored papers on service-oriented architecture and ontologies for  May 2019 - May 2021  CSER 2020 and IEEE IGARSS 2021.  • Configured Docker and auto-deploys for 11 MBSE research projects.  Disney, Software Developer Intern • Developed full-stack tools with React, Django, NGINX, and MySQL for  May 2020 – Aug 2020  800+ users to aid in the production of animated content.  PROJECTS  IPV IoT, Network Monitoring Toolkit • Analyzed TCP/UDP packets from Wireshark to classify IoT devices. • Interviewed 10+ tech-abuse survivors to develop device detection tools.  Feb 2022 - Present  NOS-T, Distributed Simulation Infrastructure • Led development of simulation infrastructure under $965k NASA  Aug 2020 - May 2021  contract to support 7 teams from JPL, MIT, UIUC, Ames, and Goddard. • Managed team of 4 engineers to architect Python control service using  MQTT-based Pub/Sub to support 10k events/second.  Market Maker, Hanlon-Capco Trading Competition Mar 2020 - May 2020 • Won 1st of 14 teams with multi-threaded market maker in Python. • Implemented inventory management strategy to mitigate risk. • Formed alphas using technical indicators: MACD, BBANDS.  \f"
  },
  {
    "name": "Parthit Patel",
    "strength": "Coding, Software, Communication, Design, HCI",
    "industries": "Big Tech (Apple, Tesla, NVidia, Google, Meta, etc.), Startups",
    "resume": "PARTHIT PATEL  New York, NY | +1 646-206-6281 | pbp38@cornell.edu | GitHub | LinkedIn   EDUCATION  Cornell Tech, New York, NY  Dual Master of Science Degrees – Applied Information Science and Information Systems| Merit Scholar – GPA 4.0              May 2023   Savitribai Phule Pune University, Pune, India  Bachelor of Engineering in Computer Engineering | CGPA: 9.06               May 2020    RELEVANT COURSEWORK   • Data Structures and Algorithms • Machine Learning Engineering • Human Computer Interaction • Database Management Systems          • Psychological and Social Aspects of Tech • Designing Data Products • Data Mining and Warehousing • Computer Vision     TECHNICAL SKILLS   Programming Languages   Web Development  Tools    : Python, JavaScript ES6, Dart, Solidity, Java, SQL, C#, C++  : HTML, CSS, ReactJS, Flutter, Ruby on Rails  : TensorFlow, PyTorch, Pandas, AWS Cloud, Jest, Enzyme, Git, Figma, Unity, Jira, Blender   EXPERIENCE    Software Engineering Intern, QuickBooks Commerce, Intuit, New York          May 2022-August 2022   •  Created reusable frontend components interacting with the backend service layer using ReactJS, pushing changes to production  •  Utilized ReactJS to integrate a table component with the Ruby on Rails monolith. Enhanced the user experience by   productionizing additional features for sorting, pagination, and client-side search. Created a roadmap to enable bulk actions for  further development (React, Ruby)   •  Followed Agile methodology to set and deliver milestones for each biweekly sprint. Gained experience with iterative development   processes, continuous delivery with progressive deployments, feature toggles, and experimentation.   AR Developer, Shastrarth Academy, India             April 2020- Sept 2020   •  Developed a multiplatform (Android, iOS) Augmented Reality App using the Unity Game Engine for a class of 30 elementary   school students. Created and utilized custom assets made using Blender (C#, Blender)   •  Used the Vuforia AR SDK to incorporate virtual buttons and target-image based actions to make remote learning more engaging   Research Intern, University of Cambridge, United Kingdom (Remote)                      April 2019- August 2019   •  Analyzed the effect of different chemical compounds on Cardiomyocyte cells. Used image processing tools to perform video   analysis and plot their activity over time. Activity graphs of the cells helped in advancing research to combat arrhythmia (Image4J)  •  Authored a proof-of-concept to enable democratized healthcare data storage and sharing based on Hyperledger Fabric and IPFS.   Published paper in the International Conference on Blockchain    PROJECTS    Arxiv.org, Specialization Project, Cornell Tech           Spring 2021- Ongoing   •  Devising and creating Author Anonymization as an experimental feature for https://arxiv.org  •  Using Pandas and Matplotlib to analyze datasets about research papers uploaded, providing actionable insights to arxiv.org about   universities and their academic inclinations    Measuring impact of network nodes failing, Cornell Tech                 Fall 2021   •  Examined publicly available blockchain transaction data from Grassroots Economics to plot network graphs of transactions   between different nodes. Measured the impact of the top 3 nodes belonging to different centrality measures being taken out of  the network   •  Used pandas, networkx and matplotlib to plot the network, measure the effect and importance of these nodes and testing the   resilience of the network   CERTIFICATIONS    AWS Certified Cloud Practitioner, Amazon Web Services  TensorFlow Developer Certificate, TensorFlow Certificate Program              Sept- 2022                            July- 2021  1                                                                                                                                                                                  \f"
  },
  {
    "name": "Saurav Panda",
    "strength": "Time management and execution",
    "industries": "Big Tech (Apple, Tesla, NVidia, Google, Meta, etc.), Finance, Startups",
    "resume": "SAURAV PANDA  New York, NY | 917-704-6644 | sgp65@cornell.edu  Linkedin | Github |StackOverFlow| Portfolio | Upwork | Google Scholar   EDUCATION  Cornell Tech – Cornell University, New York, NY  Masters of  Science, MS, Information Technology and Applied Information Science  Relevant Coursework: Algorithms and Data Structures, Cryptography, Machine Learning Engineering, Human-Computer Interaction  Awards: Merit Scholarship Award Recipient             Aug 2021 - May 2023   University of  Mumbai, Mumbai, India  Bachelor of  Engineering in Electronics and Telecommunication  Relevant Coursework: Operating Systems, Network Theory, Data Compression and Encryption, Digital Communication            Aug 2014 - May 2018    EXPERIENCE   DevOps Intern, SiriusXM, New York, USA                                                                      June 2022 - Aug 2022   • Developed a secured pipeline using cloud front to generate V4 signature for S3 objects. (Jenkins, S3, Cloudfront)  • •  Refactored and documented scripts for an internal tool. (Python, Git)  Collaborated with senior developers to create a process to improve and modify strategies for git-flow using versions and tagging.   Founder and CEO (Exited), Botonomics Automations LLP, Mumbai, India  Botonomics is a SaaS-based chatbot platform.             June 2019 - July 2021   • Designed and developed a SaaS platform that creates different types of  chatbot support and AI based FAQ agents powered by   spacy. Administered a team of  6 employees during my tenure.  • Built the full stack backend using Django and Flask Rest API. Utilised serverless AWS services to build scalable micro-services.  • Devised  a  unique  multi-cloud  architecture  to  deploy  custom  NLP  models  using  serverless  technology,  reducing  the  cost  of    operation by 70%.(AWS, Google Cloud)   Software Developer, Freelancer, Mumbai, India                                                      Nov 2017 - Aug 2021  31+ jobs completed for 20+ global clients with 100% Upwork job success rate and Top-Rated Plus Freelancer (Top 3%) worldwide on  Upwork. Some of  the projects are listed below:   •  •  •  •  •  Engineered a GUI-based ML tool for data processing, training and visualization using Angular. This helped C-level executives of   multiple Pharma firms drive decisions for their companies.(AWS Lambda, Scikit-learn, EC2, S3)  Built a backend system to store processed data from ML models and efficiently render it to the frontend using AWS. The product  helped clients to reduce churn and prioritize development sprints. (CloudFormation, Lambda, DynamoDB)  Performed  aspect-based  sentiment  analysis  and  deployed  a  scalable  solution  on  AWS  lambda.  Refactored  existing  image  processing libraries for the client to decrease the cloud's deployment size and processing time, resulting in an 80% cost reduction  for each API call. (Spacy, AWS, NLTK, python)  Created a real-time job scraping pipeline that scraped 3000+ websites daily; parsed the data and published it to the frontend for  Radicalist Labs. Also made an internal messaging tool, payment system and internal automation tools for the clients. (Selenium,  Stripe, SQS, RDS, DynamoDB, SQL)  Spearheaded software development at Scrunch (an influencer marketing platform). Deployed a campaign analytics functionality  and updated the scraping systems. (Python, AWS, Redis, RabbitMQ, Elasticsearch)   • Designed  and  developed  a  microservice  architecture  for  Sharpdata  Analytics  (SaaS-based  data  integration  platform  for  real  estate). Implemented the CI/CD pipeline expediting the deployment rate from 2 to 5 sprints per month. Architected the interface  product, which increased the annual revenue by 280%. (AWS, Django, Lambda, EC2, DynamoDB, RDS, SQS)   TECHNICAL SKILLS  Coding Languages:  Database Technologies:    Cloud Technologies:  Other Tools / Technologies:      Python, C++, GoLang, JavaScript, HTML, Dart, Node, Java, R   MySQL, PostgreSQL, DynamoDB, MongoDB, AWS Aurora, AWS S3   AWS, Docker, DigitalOcean, Google Cloud, Heroku  Git,  Bash,  Kubernetes,  Elasticsearch,  React,  RabbitMQ,  Unity,  Jenkins,  Redis,  Hadoop/ HDFS, Flask, Django, CI/CD, Spark, Kafka   CERTIFICATION/ OR PUBLICATIONS  Certification: AWS Certified Solutions Architect – Associate Issued By Amazon Web Services Training and Certification  Certification: - Natural Language Processing with Deep Learning, Stanford Center for Professional Development (SCPD)  Certification: - Natural Language Understanding (SCPD)  Publications: - Feature Selection for Driver Drowsiness Detection  Publications: - Design and Implementation of  Low Cost Optical Spectrometer   1                                                               \f"
  },
  {
    "name": "Nicholas Agnihotri Burka",
    "strength": "Interpreting the problem and translating this to a solution with technical steps",
    "industries": "Startups, PITech",
    "resume": "NICHOLAS AGNIHOTRI BURKA  New York, NY | 646-457-8209 | nab262@cornell.edu   EDUCATION  Cornell Tech, New York, NY  Master of  Science in Information Science, concentration in Connective Media  Merit Scholarship Recipient   Relevant Coursework: Public Interest Tech Studio, Product Studio, Building Startup Systems, Cryptography   Columbia Cybersecurity Bootcamp  Certificate of  Completion   Vassar College, Poughkeepsie, NY    Bachelor of  Arts in Cognitive Science, minor in Computer Science                May 2023                          August 2021                              May 2017    TECHNICAL SKILLS  Coding Languages:  Operating Systems:  Cloud/Backend:     EXPERIENCE   Freelance Web Developer     Node.js/Javascript, Python, CSS, HTML, Java, Bash, Scheme, R, Haskell   Mac, Linux, Windows   AWS/Azure/Firebase, nginx, Docker, Ansible                                   September 2020 - Present   • Developed Algorand Foundation grant-funded decentralized web app using Reach.sh, Javascript, and AWS  • Authored written and video tutorials, leading to Algorand Ambassadors program invitation  • Designed and implemented artist website, with custom filesharing backend   uBreakiFix Cambridge, Senior Repair Technician, Cambridge, MA                                                                      Sept 2018 - May 2019   • •  Completed device repairs from intake to checkout  Top performer in accessory sales & customer service   Cognition Engineering, Controls Engineer, Tucson, AZ            Sept 2017 - May 2018   • • •  Lead programmer on Cognition Engineering’s first proprietary design, a thermal annealing machine  Reprogrammed key segment of  factory line for Rainbird contract  Followed rigorous methodologies for machine safety, robustness, and speed under guidance of  CEO   National Police Foundation, Systematic Social Observation Researcher, Tucson, AZ            Sept 2017 - Nov 2017   • •  Completed narrative and quantitative reports from weekly ride-alongs with police officers and their use of  procedural justice  Commended by research leads for thorough and honest reporting   PROJECTS   Mold Watch, (HTML/CSS/Javascript, Node.js, Backblaze B2)                    An expert-informed mold risk assessment tool for residents of  public housing in NYC  • Developed VPS backend for uploading mold photos and risk metadata  • • •  Implemented frontend with A/B testing and Google Translate for site accessibility  Co-designed platform with multiple tenant advocacy organizations  Team selected from 60 to present at Cornell Tech Open Studio   TrackMeNot II, (Javascript)   The next generation of  Prof. Helen Nissenbaum’s web search obfuscation tool   • Documented and debugged TMN 1  • • Designed cloud backend for future algorithmic auditing   Implemented keyword extraction for additional obfuscation layer                               Fall 2022          Spring 2022 - Fall 2022                                                                                                                                                                            \f"
  },
  {
    "name": "Nick Pacia",
    "strength": "Problem-solving",
    "industries": "Technology",
    "resume": "Nick Pacia  snp43@cornell.edu | 169 Fort Hill Rd Scarsdale, NY 10583 | 914-246-7755   EDUCATION  Cornell University, Cornell Tech, New York, NY   Master of Engineering in Operations Research and Information Engineering, GPA: 3.57    Fordham University, New York, NY   Bachelor of Arts in Economics, GPA: 3.48   Expected May 2023    May 2022   Selected Coursework: Deep Learning • Applied Machine Learning • Applied Data Science • Optimization Methods •  Modeling Under  Uncertainty • Machine Learning Hardware and Systems • Computer Science II • Statistical Decision Making • Computer Vision •  Math for Economists • Science Fiction Physics   Honors/Awards: Dean's List Honors Fall 2021 • Dean's List Honors Fall 2020   SPECIALIZED SKILLS   Programming Languages: Python, C++  Technical Tools: NumPy, scikit-learn, pandas, Matplotlib, PyTorch, OpenCV, Gurobi, LaTeX, Microsoft Excel  Languages: Spanish (intermediate), Italian (basic)   RELEVANT ACADEMIC PROJECTS  Product Studio, Cornell Tech, Cornell University   •  Collaborated with a team of peers and the New York City Mayor's Office, including the Deputy Chief of Staff to Mayor Eric   Aug-Dec 2022    Adams, to devise an innovative strategy for the mitigation of rodent population in the city.   •  Designed and constructed a modular IoT-enabled device prototype, which can retrofit into existing public trash bins, to collect   real-time data on trash overflow, providing actionable, data-driven insights to assist in the reduction of rodent overpopulation in  New York City.   •  Created a comprehensive B2G business plan for the prototype, receiving guidance from the New York City Mayor's Office.   PROFESSIONAL EXPERIENCE  May-Aug 2021   Logistics Intern, Trucco Inc., Vineland, NJ / New York, NY   •  Led a full-system audit of the company's production data collection strategy to identify and rectify anomalies in production data.  •  Developed cost-structure models that considered variable labor costs, ROI rates, and capital depreciation in the production of   labor-intensive products.   •  Created a comprehensive roadmap to improve the company's data collection, management, and utilization practices, in an effort   to increase production output.   Census & Economic Stability Intern, Health and Welfare Council of Long Island, Huntington Station, NY   May-Aug 2020  •  Conducted extensive analysis of census response rate data for municipalities and school districts across Long Island, resulting in   actionable insights.   •  Established statistical correlations between census response rates and socioeconomic factors to optimize message targeting and   outreach efforts.   •  Developed a comprehensive end-of-term report and presentation for the company CEO, highlighting key findings on census   response rates in Long Island and their relationship to race, gender, and class.   OTHER EXPERIENCE  Volunteer Tutor, Sant’Egidio School of Peace, The Bronx, NY   •  Virtually tutored a student entering 6th grade from a low-income school system twice a week in the subjects of mathematics,   June-Aug 2020    reading, and writing.   Member, Fordham University Choir, New York, New York   •  Performed with a group of peers by singing at various university events, including sporting events and alumni events.   Jan 2019-Jan 2020   HOBBIES & INTERESTS  Hobbies: Piano, chess, AI assisted digital art.  Interests: Math, machine learning, music, film, history, philosophy, technology, science.                         \f"
  },
  {
    "name": "Yifu Liu",
    "strength": "Communication",
    "industries": "Big Technology, Google Maps, health care",
    "resume": "YIFU LIU  New York, NY | 646-784-0365 | yl896@cornell.edu  GitHub: https://github.com/KarthusL / Personal Webpage: www.yifu-liu.com   EDUCATION  Cornell Tech, New York, NY  Jacobs Technion-Cornell Dual Master of Science Degrees – Urban Tech Concentration  Merit-Based Scholarship  Relevant Coursework: Algorithm, Machine Learning Engineering, Urban Data                May  2023   University of Massachusetts Amherst, Amherst, MA   Bachelor of Science in Computer Science, Minoring in Japanese | GPA: 3.53  Relevant Coursework: Algorithm, Machine Learning, Theory & Practice/Software Engineering                               Feb  2019    TECHNICAL SKILLS  Coding Language:  Language:  Operating Systems:  Other Tools:      Python, Java, C, HTML, CSS   Japanese (N2: 110, Dec 2018), Chinese (Native Fluency)   Windows, Linux    Flask, Jupyter Notebook, Amazon EC2, Github, LaTeX, Kaggle, ArcGIS   WORKING EXPERIENCE  BASE, INC. (ベース株式会社), Software Engineering, Tokyo, Japan   Infrastructure Transition          April 2019- March 2020   •  Converted C to Java; Retrieved Json files from AWS RDS and parsed them into strings, and allocated strings into database using   PostgreSQL.   •  Accomplished and ran unit tests to check the code coverage for both implementation and database classes until 100%.  •  Wrote E2E to tests the entire software product from beginning to end to ensure the application flow behaves as expected and  prepared necessary data for the test, then simulate the product's system dependencies and ensures all integrated pieces work  together as expected.  Tough Connection System   •  Analyzed requirements of testing data and implemented PL/SQL systems to generate data for Batch-file tests.  •  Processed PL/SQL functions and procedures to generate and duplicate hundreds of millions of data from raw data to databases   and tables for testing.   •  Created Batch files to test the efficiency of program.   Chiba Bank Account Opening System   •  Utilizing OCR (Optical Character Recognition) based system to transfer scanned personal documents into 64-base data stream to   the OCR server and received returned Json files.   •  Conveyed Json files and parsed Json files using Java into database readable strings.   •   Implemented Employee Back-End Management System using HTML and CSS, which allows bank employees to read  information of bank account applications from database.   PROJECTS   AI and Applications in Healthcare System, (Python, LaTeX)           Estimate Glucose Levels Based on Clinical Data         Oct-Dec  2020   •  Reprocessed and cleaned collected clinical data (e.g., blood sugar level, insulin Level) to generate a representation for each patient.   •  Proposed a Long Short-Term Memory (LSTM) based network to predict glucose based on 4-hour continuous data  •  Conducted evaluation analysis based on Root Mean Square Error (RMSE) of 8.0mg/dL.  •  Wrote a scientific report to present the result of the experiment to UCL Professor- Dr. Li    Clustering to Compress Images, (Python, LaTeX)                April 2018   Implemented various unsupervised learning algorithm (e.g., hierarchical clustering and k-means) to perform image clustering.   Use Unsupervised Learning to Analyze Images  •  •  Conducted fine-tuning to optimize the unsupervised model and performed evaluation analysis.   •  Uploaded the reconstructed images on Kaggle, ranked in top of 15% of accuracy in the competition.   Time‑based One‑time Password Generator, (Java)               Feb-Mar  2018   Generate One-time Undecodable Password  •  Researched the document of Secure Hash Function‑2 (a set of cryptographic hash functions) then implemented a program which   generates undecodable passwords based on given strings.   •  Re-designed the program where the password generator can regenerate new passwords based on a time interval while making the   previous passwords invalid.   1                                                                                                                                          \f"
  },
  {
    "name": "Henry Xu",
    "strength": "data analysis, machine learning",
    "industries": "Big Technology, finance, trading",
    "resume": " HANYUN XU   New York, NY | 732-519-1301 |  hanyunxu227@gmail.com  |  LinkedIn    EDUCATION   Cornell Tech  , New York, NY   Master of Engineering in Operations Research and Information Engineering  | GPA: 3.81   Honors/Awards:  Merit Scholarship   Relevant Coursework  : Applied Machine Learning, Modeling  Under Uncertainty, Data Science in the wild, Data People and System    June 2022    Rutgers University – New Brunswick  , New Brunswick,  NJ   B.A. in Mathematics and Statistics  | GPA: 3.92   Honors/Awards:  Summa Cum Laude, SAS Excellence Award,  Dean’s List (all semesters)   Relevant Coursework:  Multivariate Analysis, Bayesian  Data Analysis, Regression Methods, Computing and Graphics in Applied Statistics    June 2021    TECHNICAL SKILLS   Coding/Statistical/Modeling Toolings:   Statistical Skills:    Python,  Pytorch, R, SQL, Spark, Scala, Java, SAS, C++   XGBoost, GMM, Random Forest,  KNN, Naïve Bayes), NLP, PCA, Factor Analysis,   K-means, ANN, A/B Testing    WORK EXPERIENCE   Research Data Scientist, AI Infra @ Meta,  New York,  NY    ●    ●    ●    ●    ●    ●    June 2022 - Present   Saved  2.6 MW($29M)  AI training capacity by leading  collaboration with SWE partners to design the Recurring Training Garbage   Collection Algorithm and automate the AI Asset Reaper Framework   Shaped ML Model Freshness engineering direction by collaborating with  10+  AI Infra and  5+  product teams  to design and   implement Activity-to-Serving(ATS) latency metrics to support Meta’s next-generation streaming-model updating strategies   Designed and implemented Meta’s ML Workflow Classification algorithm across  100k+  large models to identify critical  workloads   across all ML stages and improve reliability, capacity and efficiency guarantees across the company   Influenced engineering decisions within a team of  50+  engineers by developing fleetwide reliability  metrics and observability   solutions for Meta's real-time ML training stack   Optimized Meta’s production model latency and freshness by  8%+  via collaborating with XFN to improve Meta’s  recurring   training scheduling overhead and resource allocation strategies   Facilitated implementation and adoption of Meta’s Mixed Training framework by conducting cost/benefit analysis and designing   reliability metrics to track training framework performance and expedite the leadership decision-making process    PROJECTS   Analyzing Elon Musk Tweets with NLP to Find Fluctuations in Crypto Market Prices  (Python)    2021 Fall    ●   ●   ●   ●    Gathered Dogecoin pricing data and visualized the historical close price and transaction volume via  Seaborn   Preprocessed Tweets data with  One-Hot Encoding  and  setup threshold to reduce dimensionality of wording matrix via  Sklearn   Constructed  MLP  ,  SVM  ,  and  XGBoost  to find the connection  between the price change of Dogecoin and Elon’s tweets   Analyzed the model performance with the  learning curve  ,  loss curve  , and  confusion matrix  , and iterated the  models to tune   classification accuracy via feature selection and  sentimental analysis    Analysis and Prediction of COVID-19 growth in the United States  (Python)    2021  Spring   Implemented  PCA  to analyze the main factors in the  growth of infected population and forecast the growth rate, which explained   68% variance in backtesting of the death and infection rate after the second wave of COVID-19 in the United States   Led the team to  crawl, combine and clean COVID-19  datasets and visualized the data by different features   Tested performance difference and accuracy between  GLM  and  PCA  models by  K-fold cross-validation  and  MAE    ●    ●   ●    Prediction of female life expectancy in the developing countries  (R)    2021 Spring    ●   ●    ●    Conducted the research on finding the potential economic and social factors related to female life expectancy   Built-up prediction models with  logistic regression  ,  naive Bayes  , and  random forest  to forecast female  life expectancy in the   developing countries with socioeconomic factors, returned ROC AUC ranged from 0.54 to 0.89   Constructed  K-means  model to cluster the females and  give recommendations on financial aid, investment, and infrastructure    COMPETITION EXPERIENCE   China Undergraduate Mathematical Contest in Modeling - 1  st  Prize, Team Leader,  Chengdu, China    September  2019   Led team of 3 in data waggling, feature selection, model selection, and optimization to evaluate a relationship between colors and   chemical concentration and provide a recommendation system on levels of chemical concentration   Performed  principal  component analysis  ,  stepwise regression  ,  and  Lasso regression  to compare and screen the significant   color variables to deal with the data high-dimensionality and sparsity    ●    ●   \f"
  }
]
